![title](imagens/M05-Pandas.jpg)

# Pandas - Noções básicas do pacote Pandas - Parte 5

# Mesclar, Juntar, e Concatenar


Existem três maneiras principais de combinar os DataFrames: mesclando, juntando e concatenando (merge, join e concat). Vamos ver esses 3 métodos com exemplos.

### 6.1 Introdução aos Comandos

**merge:**

Combina DataFrames com base em colunas comuns.
Funciona como um “join” no SQL.

**join:**

Combina DataFrames com base em índices ou colunas.
Pode ser usado para combinar DataFrames verticalmente ou horizontalmente.

**concat:**

Concatena DataFrames verticalmente ou horizontalmente.
Útil para empilhar ou mesclar dados.

____

### 6.2 Criando um Dataframe de exemplo

In [1]:
# Importando o Pandas
import pandas as pd

In [2]:
# DataFrame 1
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Nome': ['Alice', 'Bob', 'Carol']})

In [3]:
# DataFrame 2
df2 = pd.DataFrame({'ID': [2, 3, 4], 'Salário': [5000, 6000, 7000]})

Exibindo o conteúdo desses dois DataFrames criados...

In [4]:
df1

   ID   Nome
0   1  Alice
1   2    Bob
2   3  Carol

In [5]:
df2

   ID  Salário
0   2     5000
1   3     6000
2   4     7000

### 6.3 Mesclar (merge)

A função ** mesclar ** permite que você mescle os quadros de dados juntos usando uma lógica semelhante à mesclagem de tabelas SQL juntas. Por exemplo:

Inner Join:

In [6]:
df_inner = pd.merge(df1, df2, on='ID')
df_inner

   ID   Nome  Salário
0   2    Bob     5000
1   3  Carol     6000

Left Join:

In [7]:
df_left = pd.merge(df1, df2, on='ID', how='left')
df_left

   ID   Nome  Salário
0   1  Alice      NaN
1   2    Bob   5000.0
2   3  Carol   6000.0

### 6.4 Juntar (join)
Juntar (join) é um método conveniente para combinar as colunas de dois DataFrames indexados potencialmente diferentes em um único resultado DataFrame.

Join por Índice

In [8]:
df_index_join = df1.set_index('ID').join(df2.set_index('ID'))
df_index_join

     Nome  Salário
ID
1   Alice      NaN
2     Bob   5000.0
3   Carol   6000.0

Join por Coluna

In [9]:
df_col_join = df1.join(df2.set_index('ID'), on='ID')
df_col_join

   ID   Nome  Salário
0   1  Alice      NaN
1   2    Bob   5000.0
2   3  Carol   6000.0

### 6.5 Concatenação (concat)

Concatenação basicamente cola DataFrames.  Tenha em mente que as dimensões devem corresponder ao longo do eixo que você está concatenando. Você pode usar `pd.concat` e passar uma lista de DataFrames para concatenar juntos:

Concatenação Horizontal

In [10]:
df_horizontal = pd.concat([df1, df2], axis=1)
df_horizontal

   ID   Nome  ID  Salário
0   1  Alice   2     5000
1   2    Bob   3     6000
2   3  Carol   4     7000

Concatenação Vertical

In [11]:
df_vertical = pd.concat([df1, df2])
df_vertical

   ID   Nome  Salário
0   1  Alice      NaN
1   2    Bob      NaN
2   3  Carol      NaN
0   2    NaN   5000.0
1   3    NaN   6000.0
2   4    NaN   7000.0

# FIM